stubs/src/main/resources/wsdl/cte/mg/prod/event.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.2-1 git-revision#dbe58a8. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.2-1 git-revision#dbe58a8. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento" name="RecepcaoEvento">
<types>
<xsd:schema>
<xsd:import namespace="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento" schemaLocation="https://cte.fazenda.mg.gov.br:443/cte/services/RecepcaoEvento?xsd=1"/>
</xsd:schema>
</types>
<message name="cteRecepcaoEvento">
<part name="cteDadosMsg" element="tns:cteDadosMsg"/>
<part name="cteCabecMsg" element="tns:cteCabecMsg"/>
</message>
<message name="cteRecepcaoEventoResponse">
<part name="cteRecepcaoEventoResult" element="tns:cteRecepcaoEventoResult"/>
<part name="cteCabecMsg" element="tns:cteCabecMsg"/>
</message>
<portType name="CteRecepcaoEventoSoap12">
<operation name="cteRecepcaoEvento" parameterOrder="cteDadosMsg cteCabecMsg">
<input wsam:Action="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento/cteRecepcaoEvento" message="tns:cteRecepcaoEvento"/>
<output wsam:Action="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento/CteRecepcaoEventoSoap12/cteRecepcaoEventoResponse" message="tns:cteRecepcaoEventoResponse"/>
</operation>
</portType>
<binding name="CteRecepcaoEventoSoap12Binding" type="tns:CteRecepcaoEventoSoap12">
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="cteRecepcaoEvento">
<soap12:operation soapAction="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento/cteRecepcaoEvento"/>
<input>
<soap12:body use="literal" parts="cteDadosMsg"/>
<soap12:header message="tns:cteRecepcaoEvento" part="cteCabecMsg" use="literal"/>
</input>
<output>
<soap12:body use="literal" parts="cteRecepcaoEventoResult"/>
<soap12:header message="tns:cteRecepcaoEventoResponse" part="cteCabecMsg" use="literal"/>
</output>
</operation>
</binding>
<service name="RecepcaoEvento">
<port name="CteRecepcaoEventoSoap12" binding="tns:CteRecepcaoEventoSoap12Binding">
<soap12:address location="https://cte.fazenda.mg.gov.br:443/cte/services/RecepcaoEvento"/>
</port>
</service>
</definitions>