Modulos/TecnoSpeed/CTe/Arquivos/Templates/2.00a/EPEC/pedido_enviarepeccte.soap

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.portalfiscal.inf.br/cte" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <cteCabecMsg xmlns="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento">
      <cUF>%s</cUF>
      <versaoDados>%s</versaoDados>
    </cteCabecMsg>
  </soap12:Header>
  <soap12:Body>
    <cteDadosMsg xmlns="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento">%s</cteDadosMsg>
  </soap12:Body>
</soap12:Envelope>