Modulos/TecnoSpeed/CTe/Arquivos/Templates/3.00/MT/envioEventoCT_soap.xml

<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:cter="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento"><soap12:Header><cteCabecMsg><cUF>%s</cUF><versaoDados>%s</versaoDados></cteCabecMsg></soap12:Header><soap12:Body><cter:cteDadosMsg>%s</cter:cteDadosMsg></soap12:Body></soap12:Envelope>